---
kind: method
id: M:Autodesk.Revit.DB.IExportContextBase.OnText(Autodesk.Revit.DB.TextNode)
source: html/008311bb-c88d-3c22-dc06-f34a59f8329c.htm
---
# Autodesk.Revit.DB.IExportContextBase.OnText Method

This method is called when a text annotation object is being output.

## Syntax (C#)
```csharp
void OnText(
	TextNode node
)
```

## Parameters
- **node** (`Autodesk.Revit.DB.TextNode`) - An output node that represents a text annotation.